Autodesk.Revit.DB.CompoundStructureLayer.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CompoundStructureLayer.LayerCapFlag
Identifies if the layer participates in wrapping at end caps and/or inserts.
True if the layer participates in wrapping, false otherwise.  It is meaningful only for Shell layers
(for Core layers, the value is always true). The default value is true.

Autodesk.Revit.DB.CompoundStructureLayer.LayerId
The id of the layer - note that this may be different from the index in the array of layers in a CompoundStructure.

Autodesk.Revit.DB.CompoundStructureLayer.DeckProfileId
The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck.
The default is InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructureLayer.MaterialId
Id of the material assigned to this layer.
The default is InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructureLayer.DeckEmbeddingType
Embedding type for structural deck - only for a layer whose function is StructuralDeck.
The default is StructDeckEmbeddingType.Invalid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructureLayer.Function
The function of the layer.
The default is MaterialFunctionAssignment.None.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructureLayer.Width
Width of the layer.
Remarks:
Can be 0.0 if this is a membrane layer.  0.0 is the default.

Autodesk.Revit.DB.CompoundStructureLayer.#ctor(System.Double,Autodesk.Revit.DB.MaterialFunctionAssignment,Autodesk.Revit.DB.ElementId)
Creates a default compound structure layer based on the given width, function and material element id.
width:
The width of the layer.
function:
The function of the layer.
materialId:
The material element id of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructureLayer.#ctor(Autodesk.Revit.DB.CompoundStructureLayer)
Creates a copy of a compound structure layer.
cs:
The compound structure to copy.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CompoundStructureLayer.#ctor
Creates a compound structure layer using default settings.
Remarks:
Note that the combination of the default values does not create a completely valid CompoundStructureLayer.
You should change the necessary values before adding to a CompoundStructure.

Autodesk.Revit.DB.CompoundStructureLayer
Describes a single layer in a CompoundStructure.